### DataFrame에서 원소/요소 데이터 변경

In [1]:
# 모듈로딩
import pandas as pd

In [2]:
# 데이터 준비
data={'name':['홍길동','마징가','원더우면'],
      'job':['의적','로봇','영웅'],
      'gender':['남','남','여'],
      'age':[100,200,300],
      'height':[180,300,200]}

In [3]:
# DF로 데이터 저장
dataDF=pd.DataFrame(data)
dataDF

   name job gender  age  height
0   홍길동  의적      남  100     180
1   마징가  로봇      남  200     300
2  원더우면  영웅      여  300     200

###[원소/요소 값 변경]

In [9]:
## 홍길동의 성별을 '남' => '여' 변경
## 현재 홍길동의 성별 정보 추출
dataDF.iloc[0,2]

'남'

In [11]:
## 홍길동의 성별을 '남' => '여' 변경
dataDF.iloc[0,2]='여'
dataDF

   name job gender  age  height
0   홍길동  의적      여  100     180
1   마징가  로봇      남  200     300
2  원더우면  영웅      여  300     200

In [12]:
## 원더우먼의 직업을 '영웅' => '직장인' 변경
dataDF.iloc[2,1]='직장인'
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1   마징가   로봇      남  200     300
2  원더우면  직장인      여  300     200

- [행 전체 값 변경]

In [13]:
# 행 전체 선택 => 변수명.iloc[] 또는 변수명.loc[]
# 마징가행 (1번행) 추출
dataDF.iloc[1]

name      마징가
job        로봇
gender      남
age       200
height    300
Name: 1, dtype: object

In [15]:
# 1번행 값 변경
dataDF.iloc[1]=['마징가2','영웅','여',90,170]
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1  마징가2   영웅      여   90     170
2  원더우면  직장인      여  300     200

In [16]:
# 1번행 값 변경 => 1개 == 데이터 개수
dataDF.iloc[1]=0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100     180
1     0    0      0    0       0
2  원더우면  직장인      여  300     200

In [18]:
dataDF.height=0
dataDF

   name  job gender  age  height
0   홍길동   의적      여  100       0
1     0    0      0    0       0
2  원더우면  직장인      여  300       0